'use client';
import { Box, AboutBox, Title, About } from './AboutInfo.styled';

const AboutInfo = () => {
  return (
    <AboutBox>
      <Box>
        <Title>Про нас</Title>
        <About>
          Приватне підприємство &rsquo;Хімбрук&rsquo; на ринку з 2006 року.
          Підприємство займається імпортом та дистрибуцією неорганічних
          синтетичних пігментів та різноманітних добавок які використовуються у
          різних галузях промисловості таких як: виробництва виробів з бетону,
          будівельних матеріалів, лакофарбової продукції штучних пластмас та ін.
          Виходячи з вимог сучасного ринку пропонуємо високоякісні продукти, які
          задовольняють найвибагливіших клієнтів. При цьому ми маємо конкурентні
          ціни. Це можливо завдяки багаторічній співпраці з провідними
          європейськими компаніями-виробниками пігментів та пластифікаторів, та
          гарантують своєчасне постачання партій товару, що виконують високі
          вимоги європейських норм. Перевірені торговими партнерами, займаємо
          одне з провідних місць на території України в дистрибуції неорганічних
          синтетичних пігментів для промисловості з виробництва будівельних
          матеріалів. Водночас, наше підприємство веде діяльність з метою
          підвищення якості обслуговування клієнтів в Україні, які є для нас
          дуже важливим елементом торговельного обміну. Неорганічні синтетичні
          пігменти, пропоновані підприємством &rsquo;Хімбрук&rsquo; повністю
          відповідають вимогам європейської норми ЕН 12878 щодо використання для
          фарбування будівельних матеріалів на основі цементу та вапна.
        </About>
        <About>
          Перевірені торговими партнерами, займаємо одне з провідних місць на
          території України в дистрибуції неорганічних синтетичних пігментів для
          промисловості з виробництва будівельних матеріалів. Водночас, наше
          підприємство веде діяльність з метою підвищення якості обслуговування
          клієнтів в Україні, які є для нас дуже важливим елементом
          торговельного обміну. Неорганічні синтетичні пігменти, пропоновані
          підприємством &rsquo;Хімбрук&rsquo; повністю відповідають вимогам
          європейської норми ЕН 12878 щодо використання для фарбування
          будівельних матеріалів на основі цементу та вапна.
        </About>
      </Box>
    </AboutBox>
  );
};

export default AboutInfo;
