'use client';
import { Box, AboutBox, Title, About } from './AboutInfo.styled';

const AboutInfo = () => {
  return (
    <AboutBox>
      <Box>
        <Title>Про нас</Title>
        <About>
          Приватне підприємтсво &quot;Хімбрук&quot; є компанією з багаторічним
          досвідом дистрибуції неорганічних синтетичних пігментів для різних
          галузей промисловості (виробництва, будівельних матеріалів,
          лакофарбової продукції, штучних пластмас і ін.). На ринку України з
          2006 року. Виходячи з вимог сучасного ринку, ми пропонуємо
          високоякісні продукти, які задовольняють найвимогливіших клієнтів. При
          цьому ми маємо конкурентні ціни. Це можливо завдяки багаторічному
          співробітництву з провідними європейськими фірмами, які виробляють
          пігменти і гарантують своєчасні поставки партій товару, що
          відповідають високим європейським стандартам. Будучи перевіреним
          торговим партнером, ми займаємо одне з провідних місць на території
          України з продажу неорганічних синтетичних пігментів для промисловості
          та виробництва будівельних матеріалів. Одночасно наша фірма здійснює
          діяльність з метою збільшення продажів на ринках східної України, які
          є для нас дуже важливим елементом торгового обміну. Неорганічні
          синтетичні пігменти, що пропонуються компанією &quot;Хімбрук&quot;,
          повністю відповідають європейському стандарту EN 12878, щодо
          використання для забарвлення будівельних матеріалів на основі цементу
          і вапна. Тай таке!!!!!!!!!!!!!!!!!!!!!
        </About>
        <About>
          Пропоновані нашою фірмою пігменти є високоокисленими железними
          сполуками. Вони без запаху, нетоксичні та не підпалюються. Ці пігменти
          відрізняються високою інтенсивністю забарвлення, хорошою здатністю
          покриття та легкістю змішування в сухих сумішах. Вони повністю
          відповідають вимогам будівельної промисловості щодо забарвлення
          бетонних виробів, таких як тротуарна плитка, черепиця, етерніт,
          терразіт, штукатурки, фарби та лаки. Железовмісні пігменти стійкі до
          впливу атмосфери, світла, цементу та вапна і після спеціального
          змішування дозволяють отримати вироби потрібного кольору та стійкого
          забарвлення. При виробництві бетонних виробів дозуємо пігмент у
          кількості від 3 до 5% відносно маси цементу в суміші, що дозволяє
          отримати привабливі відтінки залежно від потреб виробника. Пігменти
          можна додавати як у воду, так і в суху суміш, забезпечуючи необхідну
          тривалість змішування, що допоможе досягти рівномірного розподілу
          пігмента в суміші. Для досягнення бажаного результату дуже важливо
          провести проби, що визначать кількість доданого в крошку і цемент
          пігмента. Слід зазначити, що відтінок готових виробів, крім пігмента,
          впливає цілий ряд інших факторів, таких як: Рівень пігментації. При
          рівні, коли вміст цементу в сухій бетонній суміші становить від 5 до
          8%, настає повне насичення кольору. Додавання пігмента далі не має
          великого ефекту. Але при додаванні мінімальної дози пігмента
          (наприклад, 3% або менше), коливання в дозуванні основних матеріалів
          або помилка в дозуванні пігмента можуть призвести до значних
          відмінностей у відтінках кольору. Власний колір цементу. Цементи, які
          є на ринку, можуть мати відтінки від білого і світло-сірого до
          темно-сірого. Власний колір цементу має особливо велике значення при
          використанні світлих відтінків, наприклад, жовтого або світлих
          відтінків коричневого кольору. Вода/цемент. При забарвленні бетону
          відтінок стає світлішим зі збільшенням вмісту води. Вид і колір
          крошки. При фарбуванні бетону забарвлюється виключно зв&rsquo;язуючий
          матеріал навколо крошки, а не сама крошка. Оскільки вплив атмосфери
          призводить до відкривання зерен крошки, їх природний колір впливає на
          результат забарвлення виробу. Тому слід підбирати, наскільки це
          можливо, колір крошки до кольору бажаного виробу. Спосіб приготування
          бетонної суміші. Щоб уникнути нерівномірного розподілу пігмента в
          суміші, слід звернути увагу на два основних елементи: час
          перемішування, в якій послідовності наливаються компоненти суміші. Час
          перемішування - фактор, обмежений параметрами технологічної лінії.
          Тому дуже важливим елементом є послідовність, в якій наливаються
          компоненти суміші. Після піску з крошкою спочатку дозують пігмент, а
          порядок решти компонентів - цементу та води - не має значення.
          Вапняковий нальот. Поява вапнякового нальоту не може бути зумовлена
          використанням пігментів. При зв&rsquo;язуванні бетону утворюється
          вільний гідроксид кальцію, розчинний у воді. Коли він потрапляє на
          поверхню бетону, він з&rsquo;єднується з вуглекислим газом, що
          міститься у повітрі, згідно з хімічною реакцією: Ca(OH)2 + CO2 = CaCO3
          + H2O утворюючи нерастворимий карбонат кальцію. Щоб уникнути утворення
          нальоту, слід уникати потрапляння води на бетон. На першому етапі
          зв&rsquo;язування бетону слід уникати коливань температури, сквозняків
          та змокання компонентів. У застиглому бетоні значно знижується
          схильність до утворення нальоту, а зливовий кислотний дощ спричиняє їх
          розкладання і вимивання.
        </About>
      </Box>
    </AboutBox>
  );
};

export default AboutInfo;
