'use client';
import { Box, AboutBox, Title, About } from './AboutInfo.styled';

const AboutInfo = () => {
  return (
    <AboutBox>
      <Box>
        <Title>Про нас</Title>
        <About>
          Приватне підприємтсво &quot;Хімбрук&quot; є компанією з багаторічним
          досвідом дистрибуції неорганічних синтетичних пігментів для різних
          галузей промисловості (виробництва, будівельних матеріалів,
          лакофарбової продукції, штучних пластмас і ін.). На ринку України з
          2006 року. Виходячи з вимог сучасного ринку, ми пропонуємо
          високоякісні продукти, які задовольняють найвимогливіших клієнтів. При
          цьому ми маємо конкурентні ціни. Це можливо завдяки багаторічному
          співробітництву з провідними європейськими фірмами, які виробляють
          пігменти і гарантують своєчасні поставки партій товару, що
          відповідають високим європейським стандартам. Будучи перевіреним
          торговим партнером, ми займаємо одне з провідних місць на території
          України з продажу неорганічних синтетичних пігментів для промисловості
          та виробництва будівельних матеріалів. Одночасно наша фірма здійснює
          діяльність з метою збільшення продажів на ринках східної України, які
          є для нас дуже важливим елементом торгового обміну. Неорганічні
          синтетичні пігменти, що пропонуються компанією &quot;Хімбрук&quot;,
          повністю відповідають європейському стандарту EN 12878, щодо
          використання для забарвлення будівельних матеріалів на основі цементу
          і вапна.
        </About>
      </Box>
    </AboutBox>
  );
};

export default AboutInfo;
